In [121]:
import pandas as pd

In [122]:
log = pd.read_csv("log (1).xls")
log.columns = ['user_id', 'time', 'bet', 'win']

users = pd.read_csv("users (1).xls", sep = '\t' , encoding = 'koi8_r')
users.columns = ['user_id', 'email', 'geo']
log.info(), users.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 999 entries, 0 to 998
Data columns (total 4 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   user_id  999 non-null    object
 1   time     984 non-null    object
 2   bet      485 non-null    float64
 3   win      138 non-null    float64
dtypes: float64(2), object(2)
memory usage: 31.3+ KB
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 100 entries, 0 to 99
Data columns (total 3 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   user_id  100 non-null    object
 1   email    99 non-null     object
 2   geo      97 non-null     object
dtypes: object(3)
memory usage: 2.5+ KB

(None, None)

Посчитайте количество пропусков в столбце time. Метод isna() есть не только у DataFrame, но и у Series. Это значит, что применять его можно не только ко всей таблице, но и к каждому столбцу отдельно.

In [123]:
log.time.isna().value_counts()

False    984
True      15
Name: time, dtype: int64

In [126]:
log.dropna(axis = 1)
log.dropna(axis = 0) #

,user_id,time,bet,win
13,Запись пользователя № - user_917,[2019-01-02 8:57:36,145732.0,1987653.0
28,Запись пользователя № - user_942,[2019-01-04 13:59:42,1678321.0,9876543.0
150,Запись пользователя № - user_982,[2019-01-16 21:54:22,100.0,4749.0
188,Запись пользователя № - user_964,[2019-01-21 18:34:44,200.0,4667.0
204,Запись пользователя № - user_931,[2019-01-22 5:26:59,300.0,4319.0
...,...,...,...,...
966,Запись пользователя № - user_975,[2019-04-19 22:25:15,1000.0,6108.0
970,Запись пользователя № - user_912,[2019-04-20 10:35:49,10554.0,31799.0
971,Запись пользователя № - user_926,[2019-04-20 10:35:50,10354.0,30244.0
975,Запись пользователя № - user_970,[2019-04-20 10:35:54,10354.0,30691.0
990,Запись пользователя № - user_965,[2019-04-20 12:55:41,800.0,6927.0

Используйте оригинальный датасет log.csv.

С данными в столбцах bet и win мы разберемся позже: пропуски в этих столбцах требуют особого подхода.

А сейчас:

если есть пропуски в столбце user_id - удалите столбец user_id,

если есть пропуски в столбце time - удалите столбец time.

Запишите в поле ответа, количество оставшихся столбцов в данных, после этих действий.

In [16]:
log.info()
log.time.dropna()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 999 entries, 0 to 998
Data columns (total 4 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   user_id  999 non-null    object
 1   time     984 non-null    object
 2   bet      485 non-null    float64
 3   win      138 non-null    float64
dtypes: float64(2), object(2)
memory usage: 31.3+ KB

0      [2019-01-01 14:51:16
1      [2019-01-01 16:31:16
2      [2019-01-01 17:17:51
3      [2019-01-01 21:31:18
4      [2019-01-01 23:34:55
               ...
990    [2019-04-20 12:55:41
991    [2019-04-20 14:59:36
992    [2019-04-20 17:09:56
993    [2019-04-20 18:10:07
994     [2019-04-20 9:59:58
Name: time, Length: 984, dtype: object

In [17]:
dpp = log.drop_duplicates(['user_id', 'time'])
dpp

                              user_id                  time       bet     win
0    Запись пользователя № - user_973  [2019-01-01 14:51:16       NaN     NaN
1    Запись пользователя № - user_903  [2019-01-01 16:31:16       NaN     NaN
2    Запись пользователя № - user_954  [2019-01-01 17:17:51       NaN     NaN
3    Запись пользователя № - user_954  [2019-01-01 21:31:18       NaN     NaN
4    Запись пользователя № - user_917  [2019-01-01 23:34:55  156789.0     NaN
..                                ...                   ...       ...     ...
990  Запись пользователя № - user_965  [2019-04-20 12:55:41     800.0  6927.0
991  Запись пользователя № - user_967  [2019-04-20 14:59:36   10154.0     NaN
992  Запись пользователя № - user_973  [2019-04-20 17:09:56   10254.0     NaN
993  Запись пользователя № - user_977  [2019-04-20 18:10:07   10354.0     NaN
994  Запись пользователя № - user_984   [2019-04-20 9:59:58    9754.0     NaN

[985 rows x 4 columns]

Уберите лишний символ, преобразуйте признак time к datetime. После этого найдите наибольшую дату и выведите ее без времени.

Подсказка: можно применить метод max() к получившемуся столбцу со временем.

Не забудьте избавиться от пропусков.

Запишите ответ в формате "YYYY-MM-DD".

In [18]:
log['time']=log['time'].str.replace('[','')
log['time'] = pd.to_datetime(log.time, format = '%Y-%m-%d %H:%M:%S')

In [21]:
log.time.max()

Timestamp('2019-04-20 18:10:07')

Используйте оригинальные данные log.csv, столбец time.

Подсказка: можно использовать value_counts().

Найдите минуту, которая встречалась в данных чаще всего. Введите ответ в поле ниже.

In [27]:
minutes = log['time'].dt.minute
# minutes.value_counts()

Используйте оригинальные данные log.csv, столбец time.

Подсказка: можно использовать value_counts().

Найдите месяц, который встречался в данных реже всего. Введите ответ в поле ниже.

In [176]:
month = log['time'].dt.month
month.value_counts(ascending=False)

1.0    291
3.0    264
2.0    259
4.0    170
Name: time, dtype: int64

Используйте оригинальные данные log.csv, столбец time.

Подсказка: можно использовать sum().

Посчитайте, сколько дней в данных являются выходными (то есть субботой или воскресеньем). Введите ответ в поле ниже.

In [227]:
log = pd.read_csv("log (1).xls", header = None)
log.columns=['user_id', 'time', 'bet', 'win']
log=log.dropna(subset=['time'], axis=0)
log.time = log.time.str.replace('[', '')
log.time = pd.to_datetime(log['time'])
log.time.dt.dayofweek.value_counts()

5    152
2    150
1    150
4    135
0    135
3    132
6    131
Name: time, dtype: int64

Используйте оригинальные данные log.csv, столбец time.

Подсказка: можно использовать value_counts(). Кроме этого, потребуется написать функцию, которая преобразует дату во время дня.

Договоримся, что с 0 до 5 часов - ночь, с 6 до 11 - утро, с 12 до 17 - день, с 18 до 23 - вечер.

Важно: для выполнения задания вам нужно будет избавиться от пропусков только в столбце time. Вспомните, как избавиться от пропусков только по конкретному признаку.

Посчитайте, какое время дня встречается в данных реже всего. Введите ответ в поле ниже: ночь, утро, день или вечер.

In [265]:
log = pd.read_csv("log (1).xls", header = None) 
log.columns = ['user_id', 'time', 'bet', 'win']  
log=log.dropna(subset=['time'], axis=0) 
log['time'] = log['time'].apply(lambda x: x[1:])  
log['time'] = pd.to_datetime(log['time'])
log['hour'] = log['time'].dt.hour  

def day_night(x):
    if x <= 5:
        part = 'Night'
    elif (x >= 6) & (x <= 11):
        part = 'Morning'
    elif (x >= 12) & (x <= 17):
        part = 'Day'
    else:
        part = 'Evening'
    return part  
log['day_part'] = log['hour'].apply(day_night)
log.day_part.value_counts()

Night      265
Morning    253
Day        240
Evening    227
Name: day_part, dtype: int64